Revit 2024 API
ScheduleHeightsOnSheet Members
The ScheduleHeightsOnSheet type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the ScheduleHeightsOnSheet
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetBodyRowHeights
 Returns each row's height of schedule body on sheet view.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
ColumnHeaderHeight
 The height of all schedule header part, including the gap line between header and body.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
TitleHeight
 The height of schedule title on sheet view.
See Also
ScheduleHeightsOnSheet Class
Autodesk.Revit.DB Namespace